In [2]:
import plotly.express as px
import pandas as pd
df = pd.read_csv('Final_merged.csv')
df.head()

,Unnamed: 0,SA2 Code,SA2 Name,Rent2006,Rent2011,Rent2016,Rent%2006-2011,Rent%2011-2016,Rent%2006_2016,House_avg2006,...,Income%2006_2016,2006 Bachelor 25 and over,2011 Bachelor 25 and over,2016 Bachelor 25 and over,Bachelor%2006-2011,Bacherlor%2011-2016,Bacherlor%2006-2016,Sum2006-2011,Sum2011-2016,Sum2006-2016
0,16,503021037,Kings Park (WA),74,950,950,11.84,0.00,11.84,0.00,...,19.10,3,6,3,-0.73,0.03,-0.70,25.18,0.08,30.24
1,137,507011158,North Coogee,74,849,549,10.47,-0.35,6.42,0.00,...,11.56,0,140,563,0.44,-0.06,0.38,24.98,-0.74,18.36
2,67,505021088,Innaloo - Doubleview,74,549,549,6.42,0.00,6.42,2.18,...,7.36,2386,3255,4304,0.05,0.05,0.10,15.54,-0.12,13.92
3,145,507021165,Fremantle,74,549,549,6.42,0.00,6.42,2.02,...,7.36,2865,3648,4493,0.06,0.01,0.08,12.20,0.28,13.92
4,128,506071146,Manning - Waterford,74,549,549,6.42,0.00,6.42,2.63,...,7.36,2023,2438,2918,0.05,0.03,0.08,7.47,3.23,13.89

In [ ]:

df = pd.read_csv('https://raw.githubusercontent.com/plotly/datasets/master/2014_apple_stock.csv')

fig = px.line(df, x = 'AAPL_x', y = 'AAPL_y', title='Apple Share Prices over time (2014)')
fig.show()

In [ ]:
import plotly.express as px
df = px.data.tips()
fig = px.bar(df, x="total_bill", y="day", orientation='h')
fig.show()